// 菜品营养数据库 外置文件
const dishData = {
  "菜品全量营养库": [
    {
      "菜品名称": "白水肥肠",
      "每100ml能量(kcal)": 196,
      "每100ml蛋白质(g)": 6.9,
      "每100ml脂肪(g)": 18.7,
      "是否抗炎抗氧化食材": false,
      "img": "白水肥肠.jpg"
    },
    {
      "菜品名称": "鲍鱼",
      "每100ml能量(kcal)": 85,
      "每100ml蛋白质(g)": 14.2,
      "每100ml脂肪(g)": 0.2,
      "是否抗炎抗氧化食材": true,
      "img": "鲍鱼.jpg"
    },
    {
      "菜品名称": "蛋黄虾滑",
      "每100ml能量(kcal)": 98,
      "每100ml蛋白质(g)": 12.5,
      "每100ml脂肪(g)": 6.2,
      "是否抗炎抗氧化食材": true,
      "img": "蛋黄虾滑.jpg"
    },
    {
      "菜品名称": "肥牛卷",
      "每100ml能量(kcal)": 250,
      "每100ml蛋白质(g)": 17.2,
      "每100ml脂肪(g)": 21.5,
      "是否抗炎抗氧化食材": false,
      "img": "肥牛卷.jpg"
    },
    {
      "菜品名称": "肥羊卷",
      "每100ml能量(kcal)": 253,
      "每100ml蛋白质(g)": 14.5,
      "每100ml脂肪(g)": 21.9,
      "是否抗炎抗氧化食材": false,
      "img": "肥羊卷.jpg"
    },
    {
      "菜品名称": "黄喉",
      "每100ml能量(kcal)": 106,
      "每100ml蛋白质(g)": 14.6,
      "每100ml脂肪(g)": 3.5,
      "是否抗炎抗氧化食材": false,
      "img": "黄喉.jpg"
    },
    {
      "菜品名称": "腊肉",
      "每100ml能量(kcal)": 498,
      "每100ml蛋白质(g)": 18.2,
      "每100ml脂肪(g)": 48.8,
      "是否抗炎抗氧化食材": false,
      "img": "腊肉.jpg"
    },
    {
      "菜品名称": "螺蛳粉",
      "每100ml能量(kcal)": 123,
      "每100ml蛋白质(g)": 0.84,
      "每100ml脂肪(g)": 2.11,
      "是否抗炎抗氧化食材": false,
      "img": "螺蛳粉.jpg"
    },
    {
      "菜品名称": "毛肚",
      "每100ml能量(kcal)": 70,
      "每100ml蛋白质(g)": 13.2,
      "每100ml脂肪(g)": 1.9,
      "是否抗炎抗氧化食材": false,
      "img": "毛肚.jpg"
    },
    {
      "菜品名称": "魔芋结",
      "每100ml能量(kcal)": 19,
      "每100ml蛋白质(g)": 0.11,
      "每100ml脂肪(g)": 0.1,
      "是否抗炎抗氧化食材": true,
      "img": "魔芋结.jpg"
    },
    {
      "菜品名称": "墨鱼仔",
      "每100ml能量(kcal)": 64,
      "每100ml蛋白质(g)": 13.0,
      "每100ml脂肪(g)": 0.7,
      "是否抗炎抗氧化食材": true,
      "img": "墨鱼仔.jpg"
    },
    {
      "菜品名称": "脑花",
      "每100ml能量(kcal)": 131,
      "每100ml蛋白质(g)": 10.8,
      "每100ml脂肪(g)": 9.8,
      "是否抗炎抗氧化食材": false,
      "img": "脑花.jpg"
    },
    {
      "菜品名称": "牛筋",
      "每100ml能量(kcal)": 151,
      "每100ml蛋白质(g)": 34.1,
      "每100ml脂肪(g)": 0.5,
      "是否抗炎抗氧化食材": false,
      "img": "牛筋.jpg"
    },
    {
      "菜品名称": "牛蛙腿",
      "每100ml能量(kcal)": 75,
      "每100ml蛋白质(g)": 19.9,
      "每100ml脂肪(g)": 0.3,
      "是否抗炎抗氧化食材": true,
      "img": "牛蛙腿.jpg"
    },
    {
      "菜品名称": "培根",
      "每100ml能量(kcal)": 372,
      "每100ml蛋白质(g)": 22.3,
      "每100ml脂肪(g)": 29.5,
      "是否抗炎抗氧化食材": false,
      "img": "培根.jpg"
    },
    {
      "菜品名称": "生菜",
      "每100ml能量(kcal)": 16,
      "每100ml蛋白质(g)": 1.4,
      "每100ml脂肪(g)": 0.2,
      "是否抗炎抗氧化食材": true,
      "img": "生菜.jpg"
    },
    {
      "菜品名称": "生蚝",
      "每100ml能量(kcal)": 73,
      "每100ml蛋白质(g)": 10.9,
      "每100ml脂肪(g)": 1.5,
      "是否抗炎抗氧化食材": true,
      "img": "生蚝.jpg"
    },
    {
      "菜品名称": "双椒鸡肉片",
      "每100ml能量(kcal)": 190,
      "每100ml蛋白质(g)": 22.5,
      "每100ml脂肪(g)": 9.3,
      "是否抗炎抗氧化食材": false,
      "img": "双椒鸡肉片.jpg"
    },
    {
      "菜品名称": "虾滑",
      "每100ml能量(kcal)": 80,
      "每100ml蛋白质(g)": 11.2,
      "每100ml脂肪(g)": 2.1,
      "是否抗炎抗氧化食材": true,
      "img": "虾滑.jpg"
    },
    {
      "菜品名称": "香菜",
      "每100ml能量(kcal)": 24,
      "每100ml蛋白质(g)": 1.8,
      "每100ml脂肪(g)": 0.4,
      "是否抗炎抗氧化食材": true,
      "img": "香菜.jpg"
    },
    {
      "菜品名称": "蟹柳",
      "每100ml能量(kcal)": 115,
      "每100ml蛋白质(g)": 12.3,
      "每100ml脂肪(g)": 1.6,
      "是否抗炎抗氧化食材": false,
      "img": "蟹柳.jpg"
    },
    {
      "菜品名称": "油皇鸡",
      "每100ml能量(kcal)": 265,
      "每100ml蛋白质(g)": 23.8,
      "每100ml脂肪(g)": 17.2,
      "是否抗炎抗氧化食材": false,
      "img": "油皇鸡.jpg"
    },
    {
      "菜品名称": "鱿鱼须",
      "每100ml能量(kcal)": 85,
      "每100ml蛋白质(g)": 15.2,
      "每100ml脂肪(g)": 1.1,
      "是否抗炎抗氧化食材": true,
      "img": "鱿鱼须.jpg"
    },
    {
      "菜品名称": "鱼肠",
      "每100ml能量(kcal)": 228,
      "每100ml蛋白质(g)": 12.6,
      "每100ml脂肪(g)": 18.3,
      "是否抗炎抗氧化食材": false,
      "img": "鱼肠.jpg"
    },
    {
      "菜品名称": "鱼肚",
      "每100ml能量(kcal)": 120,
      "每100ml蛋白质(g)": 22.3,
      "每100ml脂肪(g)": 1.2,
      "是否抗炎抗氧化食材": true,
      "img": "鱼肚.jpg"
    },
    {
      "菜品名称": "炸蛋",
      "每100ml能量(kcal)": 312,
      "每100ml蛋白质(g)": 13.5,
      "每100ml脂肪(g)": 24.6,
      "是否抗炎抗氧化食材": false,
      "img": "炸蛋.jpg"
    },
    {
      "菜品名称": "猪皮",
      "每100ml能量(kcal)": 220,
      "每100ml蛋白质(g)": 27.4,
      "每100ml脂肪(g)": 14.6,
      "是否抗炎抗氧化食材": false,
      "img": "猪皮.jpg"
    }
  ]
}